<?php
session_start();

// Έλεγχος αν ο χρήστης έχει συνδεθεί
if (!isset($_SESSION['user_id'])) {
    // Αν δεν έχει συνδεθεί, ανακατεύθυνση στη σελίδα σύνδεσης
<<<<<<< HEAD
    header("Location: index.php");
=======
    header("Location: login.php");
>>>>>>> fdcf3ac0bc7103ec101333d572ddae28c826284b
    exit();
}

// Αν έχει συνδεθεί, μπορείτε να χρησιμοποιήσετε το user_id από τη συνεδρία
$user_id = $_SESSION['user_id'];

// Τώρα μπορείτε να χρησιμοποιήσετε το $user_id για να ανακτήσετε τα αιτήματά του από τη βάση δεδομένων
?>
